alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F207_plbu_cull00_elements_ccw_50_run.c
/*----------------------------------------------------------------------------
*
* The confidential and proprietary information contained in this file may
* only be used by a person authorised under and to the extent permitted
* by a subsisting licensing agreement from ARM Limited.
*
*        (C) COPYRIGHT 2008-2009 ARM Limited.
*             ALL RIGHTS RESERVED
*             
* This entire notice must be reproduced on all copies of this file
* and copies of this file may only be made by a person if such person is
* permitted to do so under the terms of a subsisting license agreement
* from ARM Limited.
*
* Modified  : $Date: 2013/05/14 11:57:51 $
* Revision  : $Revision: 1.1 $
* Release   : $State: Exp $
*-----------------------------------------------------------------------------*/
#include "MaliFns.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_a.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_b.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_c.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_d.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_e.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_f.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_g.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_h.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_i.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_j.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_k.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_l.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_m.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_n.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_o.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_p.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_q.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_r.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_s.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_t.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_u.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_v.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_w.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_x.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_y.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_z.h"
#include "m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0.h"

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_a (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_b (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_c (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_d (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_e (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_f (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_g (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_h (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_i (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_j (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_k (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_l (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_m (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_n (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_o (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_p (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_q (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_r (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_s (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_t (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_u (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_v (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_w (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_x (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_y (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);
int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_z (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p);

int RunMaliTest_m400_gp_F207_plbu_cull00_elements_ccw_50_part0 (void);
int RunMaliTest_m400_gp_F207_plbu_cull00_elements_ccw_50_part1 (void);

static volatile struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *malidata_0;
static int mali_step;

int RunMaliTest_m400_gp_F207_plbu_cull00_elements_ccw_50 (int init) {
  if (init) { mali_step = 0; };
  switch (mali_step) {
    case 0  : return RunMaliTest_m400_gp_F207_plbu_cull00_elements_ccw_50_part0();
    case 1  : return RunMaliTest_m400_gp_F207_plbu_cull00_elements_ccw_50_part1();
    default : return 0;
  };
};

