alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F207_plbu_cull00_elements_ccw_50_run.c
int RunMaliTest_m400_gp_F207_plbu_cull00_elements_ccw_50_part0 (void) {
  int res = 0;
  printf("RUNNING TEST: m400_gp_F207_plbu_cull00_elements_ccw_50\n");

  /* COMMENT */                                      /* # Mali GP dump */
  /* COMMENT */                                      /* # Test name: plbu_cull00_elements_ccw */
  /* COMMENT */                                      /* # Dump   nr: 50 */
  Mali_Reset();                                      /* reset */
  Mali_WrReg(0x0,0x0,0x28,0x00080000);               /* writereg 00000028 00080000  # clear reset complete bit */
  /* SEE BELOW */                                    /* load_mem input_mem.hex */
  /* Parsed hex file. Will pagetables will be setup when frame render start detected */

  Mali_WrReg(0x0,0x0,0x8,0x00001300);                /* writereg 00000008 00001300  # GP_CTRL_REG_PLBU_CL_CURRENT_ADDR */
  Mali_WrReg(0x0,0x0,0xc,0x000013b0);                /* writereg 0000000c 000013b0  # GP_CTRL_REG_PLBU_CL_END_ADDR */
  Mali_WrReg(0x0,0x0,0x28,0x00003fff);               /* writereg 00000028 00003fff  # GP_CTRL_REG_INT_CLEAR */
  Mali_WrReg(0x0,0x0,0x2c,0x000007fe);               /* writereg 0000002c 000007fe  # GP_CTRL_REG_INT_MASK */
  /* Detected Frame Start. Initialising memory*/     /* writereg 00000020 00000002 */
  malidata_0 = (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *)Mali_LdMem(&m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0,sizeof(struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0),(int)m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0.ttb_first);
  
  /* Enable optional performance counting */
  Mali_InitPerfCounters();
  Mali_WrReg(0x0,0x0,0x20,0x00000002);
  mali_step++;                                       /* wait posedge irq */
  /* WAIT FOR INTERRUPT - unless an error - return with WFI code */
  if (res == 0) {
   return 255;
  }
  return res;
}

int RunMaliTest_m400_gp_F207_plbu_cull00_elements_ccw_50_part1 (void) {
  int res = 0;
  int have_interrupts = 0;
  /* Check for any interrupt */
  have_interrupts = Mali_InterruptCheck(0xFFFFFFFF,0xFFFFFFFF);
  if (!have_interrupts) {
   return 255;
  }

  Mali_ReadPerfCounters();
  Mali_JobPartDone();
  /* SEE BELOW */                                    /* dump_mem 00001500 00001528 > mem_dump00.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_a(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001580 00001590 > mem_dump01.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_b(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001600 00001610 > mem_dump02.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_c(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001680 000016b0 > mem_dump03.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_d(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001700 00001718 > mem_dump04.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_e(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001780 00001798 > mem_dump05.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_f(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001800 00001818 > mem_dump06.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_g(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001880 00001888 > mem_dump07.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_h(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001900 00001920 > mem_dump08.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_i(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001980 000019a0 > mem_dump09.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_j(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001a00 00001a08 > mem_dump10.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_k(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001a80 00001ab0 > mem_dump11.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_l(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001b00 00001b40 > mem_dump12.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_m(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001b80 00001b98 > mem_dump13.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_n(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001c00 00001c30 > mem_dump14.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_o(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001c80 00001cc8 > mem_dump15.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_p(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001d00 00001d18 > mem_dump16.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_q(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001d80 00001db8 > mem_dump17.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_r(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001e00 00001e30 > mem_dump18.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_s(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001e80 00001e88 > mem_dump19.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_t(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00001f00 00001f10 > mem_dump20.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_u(malidata_0);

