alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F207_plbu_cull00_elements_ccw_50_run.c
  /* SEE BELOW */                                    /* dump_mem 00001f80 00002000 > mem_dump21.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_v(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00002000 00002008 > mem_dump22.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_w(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00002080 00002090 > mem_dump23.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_x(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00002100 000025b0 > mem_dump24.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_y(malidata_0);

  /* SEE BELOW */                                    /* dump_mem 00003380 00003398 > mem_dump25.hex */
  res |= Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_z(malidata_0);

  Mali_MaskAllInterrupts();                          /* quit */
  mali_step++;
  return res;
}

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_a (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_a *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_a;
  int res = 0;
  Mali_Message("Performing data check of 40 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001500, r->data_00001500, 0, 0x00a);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_b (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_b *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_b;
  int res = 0;
  Mali_Message("Performing data check of 16 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001580, r->data_00001580, 0, 0x004);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_c (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_c *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_c;
  int res = 0;
  Mali_Message("Performing data check of 16 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001600, r->data_00001600, 0, 0x004);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_d (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_d *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_d;
  int res = 0;
  Mali_Message("Performing data check of 48 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001680, r->data_00001680, 0, 0x00c);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_e (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_e *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_e;
  int res = 0;
  Mali_Message("Performing data check of 32 bytes\n");

  res |= Mali_MemCmpMasked(p->data_00001000, 0x00001700, r->data_00001700, Mask_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_e_0  , 0x0, 0x008);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_f (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_f *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_f;
  int res = 0;
  Mali_Message("Performing data check of 32 bytes\n");

  res |= Mali_MemCmpMasked(p->data_00001000, 0x00001780, r->data_00001780, Mask_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_f_0  , 0x0, 0x008);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_g (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_g *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_g;
  int res = 0;
  Mali_Message("Performing data check of 32 bytes\n");

  res |= Mali_MemCmpMasked(p->data_00001000, 0x00001800, r->data_00001800, Mask_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_g_0  , 0x0, 0x008);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_h (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_h *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_h;
  int res = 0;
  Mali_Message("Performing data check of 16 bytes\n");

  res |= Mali_MemCmpMasked(p->data_00001000, 0x00001880, r->data_00001880, Mask_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_h_0  , 0x0, 0x004);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_i (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_i *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_i;
  int res = 0;
  Mali_Message("Performing data check of 32 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001900, r->data_00001900, 0, 0x008);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_j (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_j *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_j;
  int res = 0;
  Mali_Message("Performing data check of 32 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001980, r->data_00001980, 0, 0x008);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_k (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_k *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_k;
  int res = 0;
  Mali_Message("Performing data check of 16 bytes\n");

  res |= Mali_MemCmpMasked(p->data_00001000, 0x00001a00, r->data_00001a00, Mask_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_k_0  , 0x0, 0x004);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_l (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_l *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_l;
  int res = 0;
  Mali_Message("Performing data check of 48 bytes\n");

