alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F207_plbu_cull00_elements_ccw_50_run.c
  res |= Mali_MemCmp(p->data_00001000, 0x00001a80, r->data_00001a80, 0, 0x00c);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_m (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_m *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_m;
  int res = 0;
  Mali_Message("Performing data check of 64 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001b00, r->data_00001b00, 0, 0x010);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_n (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_n *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_n;
  int res = 0;
  Mali_Message("Performing data check of 32 bytes\n");

  res |= Mali_MemCmpMasked(p->data_00001000, 0x00001b80, r->data_00001b80, Mask_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_n_0  , 0x0, 0x008);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_o (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_o *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_o;
  int res = 0;
  Mali_Message("Performing data check of 48 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001c00, r->data_00001c00, 0, 0x00c);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_p (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_p *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_p;
  int res = 0;
  Mali_Message("Performing data check of 72 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001c80, r->data_00001c80, 0, 0x012);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_q (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_q *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_q;
  int res = 0;
  Mali_Message("Performing data check of 32 bytes\n");

  res |= Mali_MemCmpMasked(p->data_00001000, 0x00001d00, r->data_00001d00, Mask_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_q_0  , 0x0, 0x008);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_r (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_r *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_r;
  int res = 0;
  Mali_Message("Performing data check of 56 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001d80, r->data_00001d80, 0, 0x00e);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_s (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_s *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_s;
  int res = 0;
  Mali_Message("Performing data check of 48 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001e00, r->data_00001e00, 0, 0x00c);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_t (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_t *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_t;
  int res = 0;
  Mali_Message("Performing data check of 16 bytes\n");

  res |= Mali_MemCmpMasked(p->data_00001000, 0x00001e80, r->data_00001e80, Mask_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_t_0  , 0x0, 0x004);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_u (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_u *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_u;
  int res = 0;
  Mali_Message("Performing data check of 16 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001f00, r->data_00001f00, 0, 0x004);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_v (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_v *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_v;
  int res = 0;
  Mali_Message("Performing data check of 128 bytes\n");

  res |= Mali_MemCmp(p->data_00001000, 0x00001f80, r->data_00001f80, 0, 0x020);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_w (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_w *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_w;
  int res = 0;
  Mali_Message("Performing data check of 16 bytes\n");

