alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F207_plbu_cull00_elements_ccw_50_run.c
  res |= Mali_MemCmpMasked(p->data_00002000, 0x00002000, r->data_00002000, Mask_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_w_0  , 0x0, 0x004);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_x (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_x *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_x;
  int res = 0;
  Mali_Message("Performing data check of 16 bytes\n");

  res |= Mali_MemCmp(p->data_00002000, 0x00002080, r->data_00002080, 0, 0x004);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_y (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_y *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_y;
  int res = 0;
  Mali_Message("Performing data check of 1200 bytes\n");

  res |= Mali_MemCmp(p->data_00002000, 0x00002100, r->data_00002100, 0, 0x12c);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};

int Check_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_z (struct t_m400_gp_F207_plbu_cull00_elements_ccw_50_mem_0 *p) {
  struct t_CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_z *r = &CheckData_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_z;
  int res = 0;
  Mali_Message("Performing data check of 32 bytes\n");

  res |= Mali_MemCmpMasked(p->data_00003000, 0x00003380, r->data_00003380, Mask_m400_gp_F207_plbu_cull00_elements_ccw_50_check_0_z_0  , 0x0, 0x008);
  /* Return -1 if a compare fail */
  if (res) { return -1; };
  Mali_Message("Check okay \n");
  return 0;
};
